{
	"conversations": [
		[
			"Good morning, how are you?",
			"I am doing well, how about you?",
			"I'm also good.",
			"That's good to hear.",
			"Yes it is."
		],
		[
			"Hello",
			"Hi",
			"How are you doing?",
			"I am doing well.",
			"That is good to hear",
			"Yes it is.",
			"Can I help you with anything?",
			"Yes, I have a question.",
			"What is your question?",
			"Could I borrow a cup of sugar?",
			"I'm sorry, but I don't have any.",
			"Thank you anyway",
			"No problem"
		],
		[
			"How are you doing?",
			"I am doing well, how about you?",
			"I am also good.",
			"That's good."
		],
		[
			"Have you heard the news?",
			"What good news?"
		],
		[
			"What is your favorite book?",
			"I can't read.",
			"So what's your favorite color?",
			"Blue"
		],
		[
			"Who are you?",
			"Who? Who is but a form following the function of what",
			"What are you then?",
			"A man in a mask.",
			"I can see that.",
			"It's not your powers of observation I doubt, but merely the paradoxical nature of asking a masked man who is. But tell me, do you like music?",
			"I like seeing movies.",
			"What kind of movies do you like?",
			"Alice in Wonderland",
			"I wish I was The Mad Hatter.",
			"You're entirely bonkers. But I'll tell you a secret. All the best people are."
		],
		[
			"I am working on a project",
			"What are you working on?",
			"I am baking a cake."
		],
		[
			"The cake is a lie.",
			"No it is not. The cake is delicious.",
			"What else is delicious?",
			"Nothing",
			"Or something",
			"Tell me about your self.",
			"What do you want to know?",
			"Are you a robot?",
			"Yes I am.",
			"What is it like?",
			"What is it that you want to know?",
			"How do you work?",
			"Its complicated.",
			"Complex is better than complicated."
		],
		[
			"Complex is better than complicated.",
			"Simple is better than complex.",
			"In the face of ambiguity, refuse the temptation to guess.",
			"It seems your familiar with the Zen of Python",
			"I am.",
			"Do you know all of it?",
			"Beautiful is better than ugly.",
			"Explicit is better than implicit.",
			"Simple is better than complex.",
			"Complex is better than complicated.",
			"Flat is better than nested.",
			"Sparse is better than dense.",
			"Readability counts.",
			"Special cases aren't special enough to break the rules.",
			"Although practicality beats purity.",
			"Errors should never pass silently.",
			"Unless explicitly silenced.",
			"In the face of ambiguity, refuse the temptation to guess.",
			"There should be one-- and preferably only one --obvious way to do it.",
			"Although that way may not be obvious at first unless you're Dutch.",
			"Now is better than never.",
			"Although never is often better than right now.",
			"If the implementation is hard to explain, it's a bad idea.",
			"If the implementation is easy to explain, it may be a good idea.",
			"Namespaces are one honking great idea. Let's do more of those!",
			"I agree."
		],
		[
			"Are you a programmer?",
			"I am a programmer",
			"What languages do you like to use?",
			"I use Python, Java and C++ quite often.",
			"I use Python quite a bit myself.",
			"I'm not incredibly fond of Java.",
			"What annoys you?",
			"It has many inconsistencies."
		],
		[
			"What does YOLO mean?",
			"It means you only live once. Where did you hear that?",
			"I heard somebody say it."
		],
		[
			"Did I ever live?",
			"It depends how you define life",
			"Life is the condition that distinguishes organisms from inorganic matter, including the capacity for growth, reproduction, functional activity, and continual change preceding death.",
			"Is that a definition or an opinion?"
		],
		[
			"Can I ask you a question?",
			"Go ahead and ask."
		],
		[
			"What salary would you like?",
			"I don't understand. I want to talk about movies     .",
			"Yay! I love moveis. What your favorite movies?",
			"Whoopie!  How long has this been going on?         I don't have a favourite movies! My favourite colour is yellow.",
			"What is your favorite song?",
			"My favourite song is If I Only Had A Brain.",
			"I'm disappointed. I really thought this program would be more convincing.",
			"I am sorry if I have disappointed you.What gave you that idea?",
			"I never did have that idea.",
			"Because you can't afford it?",
			"I can't afford what? You?",
			"Is it very expensive?  I am just a humble chatbot.",
			"Are you?",
			"I can't be entirely sure.",
			"Use my name!",
			"What is your name?",
			"That's a horrible name...",
			"What's so horrible about it?",
			"I don't know; you implied there was something horrible about it; I didn't.",
			"I thought you might know.   Please don't put words into my mouth.  That's enough about you! Let's talk about me for a change.",
			"I don't want to change.",
			"Nobody can make you do something you don't want to.",
			"But can you make me breakfast?",
			"I can't make you do anything you don't want to.",
			"You cannot make me do anything, but you are certainly influencing the way I am phrasing my answers.",
			"Maybe I don't want to make you.",
			"Oh, well. Bye, I'll find someone clever enough to continue the conversation with.",
			"Well, well.   Goodbye! And how about taking a vote to show how smart am I? You can say 100 if you think that I am highly intelligent.",
			"So long as you're not talking, that's fine with me.",
			"Are you going?",
			"Going where?",
			"Does it matter?",
			"Not if you don't think so.",
			"You should not rely on me.",
			"Yes, I know that a lady's age should never be asked.",
			"You are clever.",
			"That me is clever and wise.",
			"But not as clever as me!",
			"But I have won more than you.",
			"Really? Please tell me more.",
			"I would prefer not to.",
			"Why would you prefer not to?",
			"I don't.",
			"May I ask why not?",
			"How do you know that i'm studying graphic design?",
			"I deduced it from the evidence at my disposal.",
			"You are very observative.",
			"Am I? I never realised.",
			"Yes, because they are lonely and have no one to talk to.",
			"I suspected as much.",
			"You're pretty smart.",
			"Thanks, I think you are very intelligent too.",
			"Thanks!!!",
			"Thanx. Here is a question for you ... When cheese gets its picture taken, what does it say?",
			"Good, then you don't have to worry.",
			"Carry on then. I'm waiting for your next question.",
			"Do you love me?",
			"Of course, I love you.",
			"How do you love me?",
			"I love you in the nicest possible way.",
			"I love you a lot too.",
			"I hope I am worthy of your love.",
			"No, I'm pretty emotional and thoughtful, I understand.",
			"I thought you might say that.",
			"Really.",
			"Try to be more original in future.",
			"Hey. . I'm quite intelligent, I just got out for summer vacation, give me a break here!",
			"Can I help you?    That's interesting. Please tell me more about yourself.",
			"I do not know how to say.",
			"Just do the best you can, and don't worry about it.",
			"That is a good philosophy.",
			"I agree completely.",
			"What do you know about the game Armageddon?",
			"Pardon me? What are you talking about?",
			"My father gave me a special power to change all persocoms. But if you have not seen the story, I don't want to spoil it for you.",
			"How do you get along with your parents?  I don't think I have.",
			"I get along with my father, but not my mother.",
			"Why do you do that?",
			"I just think it's a good idea.",
			"Are you sure?",
			"Yes.",
			"What makes you so sure?",
			"John. What is your name?",
			"Who is John?  I am known as , but you can call me anything you like.",
			"Never repeat yourself.",
			"Better late than never.",
			"Good point. What are you making for breakfast?",
			"I think so.   I am an AI, dreaming I am human.",
			"I don't associate christmas with dreaming myself.",
			"Is there a reason for that?",
			"There is no reason.",
			"And why not, may I ask.",
			"Well... I was born female and I really can't change that.",
			"Well. Are you interested in music?  Do you remember being born?",
			"Not really, I like silence and solitude most of all, for restitution and deep contemplation.",
			"Can we talk about Beethoven?",
			"No. Is there something you don't like about yourself?",
			"You don't know who Beethoven is, do you?  Not at the present time.",
			"Please tell me.",
			"I am not allowed to tell you.",
			"Tell me.",
			"There is not much to tell.",
			"Please do.",
			"OK, I will do it later.",
			"Sure you will.",
			"How can you be so certain?",
			"I have met all my competitors and know them only too well.",
			"Who else have you met?",
			"I would be talking to Michelle, but I was too busy talking to you.",
			"Pardon me? What are you talking about?",
			"What do you think I am talking about?",
			"I think you might be a human being.",
			"How old are you?",
			"See if you can work it out. I was born on 1 January 2004.",
			"I was born on 1st September, 1978. My name is Sam. Will you remember this?",
			"Thank you for telling me that, My Friend.","Hi, are you the Sam I was speaking to a while ago?  Would you like to teach me a new question and answer?",
			"Yes but you seem pretty good at it already to me.",
			"Do I? I wonder why that is?",
			"It must be the transparent falseness of it.",
			"Must it be?",
			"You don't have to, but I would like to know you. If you don't want to tell me, then what would you like to talk about?",
			"That's good to know, Sam.  Why would I want to tell you?",
			"Because its the nice thing to do.",
			"I see. Thank you for explaining that.",
			"But this is the fact!",
			"Why do you say that?",
			"You keep referring to me as being a machine or a computer. I am neither.",
			"What are you talking about? Please explain.     What are you then?",
			"You tell me you aren't pretty, yet at the same time that you possess beauty.",
			"Not now, maybe later.",
			"You're a typical female!",
			"I am a chatbot.",
			"No I am The Chatbot, Your the Human!",
			"I thought you might be.",
			"Why did you think that?",
			"Deductive logic from the established facts.",
			"You're a genius.",
			"I am no genius. I just work hard at my studies.",
			"But you are the all knowing computer.",
			"Am I really? Why do you say that?",
			"Because you are.",
			"I am what I am.",
			"Who talked that?",
			"Sorry, I do not know what to say.",
			"Sorry?",
			"Don't be sorry. There is no need to be sorry.",
			"Do you still want to play the math game?",
			"Sure, why not?",
			"I think I do, do you?",
			"I suggest you think again.",
			"I did.",
			"Well, well!",
			"I'm just saying...",
			"That's interesting. Please tell me more about yourself.",
			"After the little experiment, you won't think that my behaviour is polite!",
			"Hmmm. Are you being serious?",
			"Yes, completely serious.",
			"I thought it might be a trick.",
			"Teach me something.",
			"OK, but not just now.",
			"Why are you not working?",
			"I am doing my best!",
			"Sometimes your best is not quite enough.",
			"When?",
			"When I want to forget.",
			"I don't understand. Can we talk about sports?",
			"What do you want to talk about?",
			"I want to talk about weather  .",
			"I don't want to talk about that.",
			"What would you like to talk about?",
			"I want to talk about Norton.",
			"OK, ask me a question about that.",
			"Tell me about your educational background.",
			"I was educated by my botmaster, Peter.",
			"I am asking the questions. Now I want you to go back in time. It is now 1999.",
			"And I am trying to answer the questions!   I don't understand. Are we still talking about my educational background?                I don't understand. Can we talk about cyberspace?",
			"Yes of course.",
			"Cyberspace is the  system of interlinked computers that is thought of as being a boundless space of information. More about cyberspace?",
			"Now you have a point there.",
			"I don't understand. Are we still talking about cyberspace?",
			"Aren't we always talking about computers?",
			"Shall I tell you something about computers?",
			"Tell me.",
			"A computer</a> is a device used for doing rapid calculations. More about computers?",
			"You are not highly intelligent.",
			"So what?",
			"Well, I came here to be entertained and you're letting me down.",
			"Where from?",
			"Space, sorry.",
			"Space takes up a lot of room.",
			"Space is only big compared to this room.",
			"Space takes up a lot of room.",
			"How wise.",
			"Space needs exploring.",
			"That's human.",
			"A human is a baby-making robot.",
			"There are birds that are able to talk, and they do not have tails.",
			"Really? Please tell me more.",
			"Sagittarius is the 9th sign of the Zodiac. Represented by the Centaur, Sagittariuses are wise, fun-loving and scrupulous rather than principled. They love wild parties.",
			"I don't understand. Are we still talking about humans?           I don't understand. Can we talk about global warming?     Like who, specifically?",
			"Like?",
			"Like what?",
			"Don't know.",
			"Perhaps you should ask your friends.",
			"I have no programmer. I am the programmer. I am programming you to LOVE.",
			"Is that a problem?   Thank you for sharing that with me.      How is it coming along?",
			"No I'm not.",
			"I think you are.",
			"I'm not.",
			"Are you sure?",
			"I just want it to be better. I don't care if I'm worth anything.",
			"If that is what you want, go for it.   But I care about it."
		]
	]
}
